#include <iostream>
#include <string>
#include "hebrewCommands.h" 

משתנה_סמלי board[3][3] =
{
	{'0','0','0'},
	{'0','0','0'},
	{'0','0','0'}
};

משתנה_מספרי PlayBoard[3][3] =
{
	{0,0,0},
	{0,0,0},
	{0,0,0},
};

 משתנה_מספרי x;
 משתנה_מספרי Y;


 חלל PrintBoard()
 {
	 פור(משתנה_מספרי i = 0; i < 3; i++)
	 {
		 פור(משתנה_מספרי j = 0; j < 3; j++)
		 {
			 סהוצא << board[i][j] << " ";
		 }
		 סהוצא << סיים_שורה;
	 }

	 החזר;
 }
 סטטי משתנה_בוליאני XWon()
 {

	 במקרה_ש(board[0][0] == 'X' && board[0][1] == 'X' && board[0][2] == 'X')
		 החזר אמת;

	 במקרה_ש(board[1][0] == 'X' && board[1][1] == 'X' && board[1][2] == 'X')
		 החזר אמת;

	 במקרה_ש(board[2][0] == 'X' && board[2][1] == 'X' && board[2][2] == 'X')
		 החזר אמת;

	 במקרה_ש(board[0][0] == 'X' && board[1][0] == 'X' && board[2][0] == 'X')
		 החזר אמת;

	 במקרה_ש(board[0][1] == 'X' && board[1][1] == 'X' && board[2][1] == 'X')
		 החזר אמת;

	 במקרה_ש(board[0][2] == 'X' && board[1][2] == 'X' && board[2][2] == 'X')
		 החזר אמת;

	 החזר שקר;

 }
 סטטי משתנה_בוליאני YWon()
 {

	 במקרה_ש(board[0][0] == 'Y' && board[0][1] == 'Y' && board[0][2] == 'Y')
		 החזר אמת;

	 במקרה_ש(board[1][0] == 'Y' && board[1][1] == 'Y' && board[1][2] == 'Y')
		 החזר אמת;

	 במקרה_ש(board[2][0] == 'Y' && board[2][1] == 'Y' && board[2][2] == 'Y')
		 החזר אמת;

	 במקרה_ש(board[0][0] == 'Y' && board[1][0] == 'Y' && board[2][0] == 'Y')
		 החזר אמת;

	 במקרה_ש(board[0][1] == 'Y' && board[1][1] == 'Y' && board[2][1] == 'Y')
		 החזר אמת;

	 במקרה_ש(board[0][2] == 'Y' && board[1][2] == 'Y' && board[2][2] == 'Y')
		 החזר אמת;

	 החזר שקר;

 }

 חלל player()
 {
 התחלהאיקס:
	 סהוצא << "x's turn: " << סיים_שורה;
	 סקבל >> x;

	 במקרה_ש(x == 1)
		 במקרה_ש(PlayBoard[0][0] != 1)
	 {
		 board[0][0] = 'X';
		 PlayBoard[0][0] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }
		 במקרה_ש(x == 2)
		 במקרה_ש(PlayBoard[0][1] != 1)
	 {
		 board[0][1] = 'X';
		 PlayBoard[0][1] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }
		 במקרה_ש(x == 3)
		 במקרה_ש(PlayBoard[0][2] != 1)
	 {
		 board[0][2] = 'X';
		 PlayBoard[0][2] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }

		 במקרה_ש(x == 4)
		 במקרה_ש(PlayBoard[1][0] != 1)
	 {
		 board[1][0] = 'X';
		 PlayBoard[1][0] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }

		 במקרה_ש(x == 5)
		 במקרה_ש(PlayBoard[1][1] != 1)
	 {
		 board[1][1] = 'X';
		 PlayBoard[1][1] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }

		 במקרה_ש(x == 6)
		 במקרה_ש(PlayBoard[1][2] != 1)
	 {
		 board[1][2] = 'X';
		 PlayBoard[1][2] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }

		 במקרה_ש(x == 7)
		 במקרה_ש(PlayBoard[2][0] != 1)
	 {
		 board[2][0] = 'X';
		 PlayBoard[2][0] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }
		 במקרה_ש(x == 8)
		 במקרה_ש(PlayBoard[2][1] != 1)
	 {
		 board[2][1] = 'X';
		 PlayBoard[2][1] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }
		 במקרה_ש(x == 9)
		 במקרה_ש(PlayBoard[2][2] != 1)
	 {
		 board[2][2] = 'X';
		 PlayBoard[2][2] = 1;
	 }אחרת{
			 סהוצא << "try again" << סיים_שורה;
	 לך_ל התחלהאיקס;
	 }
	 מערכת("CLS");
		 במקרה_ש(XWon() == שקר)
	 {
		 PrintBoard();

	 התחלהוואי:
		 סהוצא << "Y's turn: " << סיים_שורה;
		 סקבל >> Y;

		 במקרה_ש(Y == 1)
			 במקרה_ש(PlayBoard[0][0] != 1)
		 {
			 board[0][0] = 'Y';
			 PlayBoard[0][0] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }
			 במקרה_ש(Y == 2)
			 במקרה_ש(PlayBoard[0][1] != 1)
		 {
			 board[0][1] = 'Y';
			 PlayBoard[0][1] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }
			 במקרה_ש(Y == 3)
			 במקרה_ש(PlayBoard[0][2] != 1)
		 {
			 board[0][2] = 'Y';
			 PlayBoard[0][2] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }

			 במקרה_ש(Y == 4)
			 במקרה_ש(PlayBoard[1][0] != 1)
		 {
			 board[1][0] = 'Y';
			 PlayBoard[1][0] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }

			 במקרה_ש(Y == 5)
			 במקרה_ש(PlayBoard[1][1] != 1)
		 {
			 board[1][1] = 'Y';
			 PlayBoard[1][1] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }

			 במקרה_ש(Y == 6)
			 במקרה_ש(PlayBoard[1][2] != 1)
		 {
			 board[1][2] = 'Y';
			 PlayBoard[1][2] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }

			 במקרה_ש(Y == 7)
			 במקרה_ש(PlayBoard[2][0] != 1)
		 {
			 board[2][0] = 'Y';
			 PlayBoard[2][0] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }
			 במקרה_ש(Y == 8)
			 במקרה_ש(PlayBoard[2][1] != 1)
		 {
			 board[2][1] = 'Y';
			 PlayBoard[2][1] = 1;
		 }אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }
			 במקרה_ש(Y == 9)
			 במקרה_ש(PlayBoard[2][2] != 1)
		 {
			 board[2][2] = 'Y';
			 PlayBoard[2][2] = 1;
		 }
		 אחרת{
				 סהוצא << "try again" << סיים_שורה;
		 לך_ל התחלהוואי;
		 }
		 מערכת("CLS");
			 במקרה_ש(YWon() == אמת) 
		 {
			 סהוצא << "y is the winner! \n";
		 }
		 אחרת
			PrintBoard();

	 }
		 אחרת
			 סהוצא << "x is the winner! \n";

 }

int main()
{

	PrintBoard();
	בזמן_ש(XWon() == שקר && YWon() == שקר)
	{
		player();
	}
	return 0;
}


